FranGuam/STM32F103C8-ADS1292R-Sensor/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define ADS1292R_CS_Pin GPIO_PIN_15
#define ADS1292R_CS_GPIO_Port GPIOA
#define ADS1292R_SCLK_Pin GPIO_PIN_3
#define ADS1292R_SCLK_GPIO_Port GPIOB
#define ADS1292R_MISO_Pin GPIO_PIN_4
#define ADS1292R_MISO_GPIO_Port GPIOB
#define ADS1292R_MOSI_Pin GPIO_PIN_5
#define ADS1292R_MOSI_GPIO_Port GPIOB
#define ADS1292R_RESET_Pin GPIO_PIN_6
#define ADS1292R_RESET_GPIO_Port GPIOB
#define ADS1292R_START_Pin GPIO_PIN_7
#define ADS1292R_START_GPIO_Port GPIOB
#define ADS1292R_DRDY_Pin GPIO_PIN_8
#define ADS1292R_DRDY_GPIO_Port GPIOB
#define ADS1292R_GPIO_Pin GPIO_PIN_9
#define ADS1292R_GPIO_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
